import mongoose from "mongoose";

const {Schema, model} = mongoose

const schema = new Schema( {
    userId: { type: Schema.Types.ObjectId, ref: "User", required: true }, //ObjectId юзера
    movieId: { type: Schema.Types.ObjectId, ref: "Movie", required: true }, //ObjectId фильма
    isWatched: {type: Boolean, default: false}, //просмотрен ли фильм
    isSeries: {type: Boolean, required: true}, //является ли фильм сериалом
    inMainList: {type: Boolean, default: true} // находится ли он на главной или в просмотренных (сделано для того, что бы фильм мог быть и на странице просмотренных и на главной для Рандомизации. То есть после добавления фильма на главную, когда пользователь нажмет на глазик модалка поинтересуется "Перенести в просмотренные?". 1.Если пользователь ответит да, то поле isWatched: true(изначально false) а поле inMainList: true (изначально true). Фильм преренесется на страницу просмотренных, тем временем модалка задаст воторой вопрос "Удалить фильм из текущего списка?". Если да, то поле inMainList: false. Фильм пропадает из главной и остается только на странице просмотренных. 2. Если пользователь ответит нет, то поле isWatched: false(изначально false) а поле inMainList: true (изначально true). Фильм останется только на главной, тем временем модалка задаст воторой вопрос "Удалить фильм из текущего списка?". Если да, то поле inMainList: false. Фильм пропадает из главной. Если оба поля false удаляем запись. 3. Если пользователь ответит да, то поле isWatched: true(изначально false) а поле inMainList: true (изначально true). Фильм преренесется на страницу просмотренных, тем временем модалка задаст воторой вопрос "Удалить фильм из текущего списка?". Если нет, то поле inMainList: true. Фильм остается и на главной чтобы учавствовать в Рандомизации, а также на странице просмотренных.
})

export default model('UserMovies', schema)